In [30]:
import pandas as pd 
df = pd.read_csv("type1_data1.csv")

In [31]:
df.isnull().sum()
df.shape

(120, 10)

In [37]:
# 1. 결측치가 있는 데이터(행)을 제거하시오
df=df.dropna()
df

        id   age city     f1  f2      f3    f4         f5  subscribed    views
2     id03  27.0   서울   61.0   1    gold  ISTJ  17.252986  2024-03-16   7312.0
5     id06  22.0   서울   57.0   0     vip  INTP  20.129444  2024-09-12  21550.0
7     id08  38.0   서울  101.0   1  silver  INFJ  83.685380  2024-03-06   3260.0
9     id10  95.0   서울   74.0   1    gold  ISFP  98.429899  2024-04-03   9992.0
10   id100  47.0   경기   53.0   0     vip  ESFP  33.308999  2024-02-21  15535.0
..     ...   ...  ...    ...  ..     ...   ...        ...         ...      ...
115  id114  22.0   대구   23.0   0    gold  INTP   0.000000  2025-02-17   9747.0
116  id115  23.0   부산   65.0   0     vip  ENTP   0.000000  2025-02-17   5628.0
117  id116  23.0   서울   12.0   1  silver  INFP   0.000000  2025-02-17   1267.0
118  id117  23.0   대구   65.0   2    gold  INFP   0.000000  2025-02-17   6543.0
119  id118  24.0   부산   94.0   1     vip  ESFJ   0.000000  2025-02-17   2356.0

[70 rows x 10 columns]

In [39]:
# 2. "views" 컬럼을 "f1" 컬럼으로 나눈 값을 새로운 컬럼으로 추가히시오 
df["추가"]=df["views"]/df["f1"]
df["추가"]
df.head(2)

,id,age,city,f1,f2,f3,f4,f5,subscribed,views,추가
2,id03,27.0,서울,61.0,1,gold,ISTJ,17.252986,2024-03-16,7312.0,119.868852
5,id06,22.0,서울,57.0,0,vip,INTP,20.129444,2024-09-12,21550.0,378.070175

In [43]:
# 3. 새로운 컬럼 값 중 가장 큰 값을 가진 행의 age를 정수로 구하시오
df.sort_values("추가",ascending=False).head(1)

,id,age,city,f1,f2,f3,f4,f5,subscribed,views,추가
115,id114,22.0,대구,23.0,0,gold,INTP,0.0,2025-02-17,9747.0,423.782609

In [46]:
result2 = df.nlargest(1,"추가")